# US - Baby Names

### Introduction:

We are going to use a subset of [US Baby Names](https://www.kaggle.com/kaggle/us-baby-names) from Kaggle.  
In the file it will be names from 2004 until 2014


### Step 1. Import the necessary libraries

In [1]:
import numpy as np
import pandas as pd

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv).

### Step 3. Assign it to a variable called baby_names.

In [13]:
baby_names=pd.read_csv('https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv')

### Step 4. See the first 10 entries

In [14]:
baby_names.head(10)

   Unnamed: 0     Id      Name  Year Gender State  Count
0       11349  11350      Emma  2004      F    AK     62
1       11350  11351   Madison  2004      F    AK     48
2       11351  11352    Hannah  2004      F    AK     46
3       11352  11353     Grace  2004      F    AK     44
4       11353  11354     Emily  2004      F    AK     41
5       11354  11355   Abigail  2004      F    AK     37
6       11355  11356    Olivia  2004      F    AK     33
7       11356  11357  Isabella  2004      F    AK     30
8       11357  11358    Alyssa  2004      F    AK     29
9       11358  11359    Sophia  2004      F    AK     28

### Step 5. Delete the column 'Unnamed: 0' and 'Id'

In [17]:
baby_names.drop(['Unnamed: 0','Id'],axis=1,inplace=True)

### Step 6. Is there more male or female names in the dataset?

In [20]:
baby_names.groupby('Gender').describe()

           Count                                                       \
           count       mean         std  min  25%   50%   75%     max
Gender
F       558846.0  29.310925   75.962992  5.0  6.0  10.0  23.0  3634.0
M       457549.0  41.615650  118.074308  5.0  7.0  12.0  29.0  4167.0

            Year                                                         \
           count         mean       std     min     25%     50%     75%
Gender
F       558846.0  2009.026258  3.137428  2004.0  2006.0  2009.0  2012.0
M       457549.0  2009.086085  3.139039  2004.0  2006.0  2009.0  2012.0


           max
Gender
F       2014.0
M       2014.0

### Step 7. Group the dataset by name and assign to names

In [26]:
names = baby_names.groupby('Name')

### Step 8. How many different names exist in the dataset?

In [45]:
names.Name.count()

Name
Aaban           2
Aadan           4
Aadarsh         1
Aaden         196
Aadhav          1
Aadhya         40
Aadi           38
Aadin           1
Aadit           3
Aaditya        14
Aadya          36
Aadyn          11
Aahan           2
Aahana         15
Aahil          14
Aahna           1
Aaiden         20
Aaima           1
Aakash         19
Aalaya          1
Aalayah        17
Aaleah          2
Aaleyah        31
Aalia           9
Aaliah         21
Aalijah         3
Aaliya         43
Aaliyah       546
Aaliyha         4
Aalyah         16
             ...
Zyir            5
Zyire           1
Zykeria        41
Zykeriah        1
Zykerria        5
Zykia           4
Zykierra        1
Zykira          2
Zykiria         2
Zyla           17
Zylah          10
Zylan           4
Zylen           2
Zyler          27
Zymari          1
Zymarion        3
Zymere         13
Zymier          3
Zymiere         3
Zymir          39
Zymire          2
Zyon          138
Zyonna         11
Zyquan          7
Zyquavious      1
Zyra            7
Zyrah           2
Zyren           1
Zyria          10
Zyriah          9
Name: Name, Length: 17632, dtype: int64

### Step 9. What is the name with most occurrences?

In [58]:
baby_names.Name.mode()
baby_names['Name'].value_counts()[baby_names['Name'].value_counts() == baby_names['Name'].value_counts().max()]

Riley    1112
Name: Name, dtype: int64

### Step 10. How many different names have the least occurrences?

In [62]:
baby_names['Name'].value_counts()[baby_names['Name'].value_counts() == baby_names['Name'].value_counts().min()].count()

3682

### Step 11. What is the median name occurrence?

In [ ]:
baby_names.Name.mean()

### Step 12. What is the standard deviation of names?

In [ ]:
names.describe()['std']

### Step 13. Get a summary with the mean, min, max, std and quartiles.